import random

countries = {
    "af": "Афганистан",
    "al": "Албания",
    "dz": "Алжир",
    "ad": "Андорра",
    "ao": "Ангола",
    "ag": "Антигуа и Барбуда",
    "ar": "Аргентина",
    "am": "Армения",
    "au": "Австралия",
    "at": "Австрия",
    "az": "Азербайджан",

    "bs": "Багамы",
    "bh": "Бахрейн",
    "bd": "Бангладеш",
    "bb": "Барбадос",
    "by": "Беларусь",
    "be": "Бельгия",
    "bz": "Белиз",
    "bj": "Бенин",
    "bt": "Бутан",
    "bo": "Боливия",
    "ba": "Босния и Герцеговина",
    "bw": "Ботсвана",
    "br": "Бразилия",
    "bn": "Бруней",
    "bg": "Болгария",
    "bf": "Буркина-Фасо",
    "bi": "Бурунди",

    "cv": "Кабо-Верде",
    "kh": "Камбоджа",
    "cm": "Камерун",
    "ca": "Канада",
    "cf": "Центральноафриканская Республика",
    "td": "Чад",
    "cl": "Чили",
    "cn": "Китай",
    "co": "Колумбия",
    "km": "Коморы",
    "cg": "Республика Конго",
    "cd": "Демократическая Республика Конго",
    "cr": "Коста-Рика",
    "hr": "Хорватия",
    "cu": "Куба",
    "cy": "Кипр",
    "cz": "Чехия",

    "dk": "Дания",
    "dj": "Джибути",
    "dm": "Доминика",
    "do": "Доминиканская Республика",

    "ec": "Эквадор",
    "eg": "Египет",
    "sv": "Сальвадор",
    "gq": "Экваториальная Гвинея",
    "er": "Эритрея",
    "ee": "Эстония",
    "sz": "Эсватини",
    "et": "Эфиопия",

    "fj": "Фиджи",
    "fi": "Финляндия",
    "fr": "Франция",

    "ga": "Габон",
    "gm": "Гамбия",
    "ge": "Грузия",
    "de": "Германия",
    "gh": "Гана",
    "gr": "Греция",
    "gd": "Гренада",
    "gt": "Гватемала",
    "gn": "Гвинея",
    "gw": "Гвинея-Бисау",
    "gy": "Гайана",

    "ht": "Гаити",
    "hn": "Гондурас",
    "hu": "Венгрия",

    "is": "Исландия",
    "in": "Индия",
    "id": "Индонезия",
    "ir": "Иран",
    "iq": "Ирак",
    "ie": "Ирландия",
    "il": "Израиль",
    "it": "Италия",

    "jm": "Ямайка",
    "jp": "Япония",
    "jo": "Иордания",

    "kz": "Казахстан",
    "ke": "Кения",
    "ki": "Кирибати",
    "kp": "Северная Корея",
    "kr": "Южная Корея",
    "kw": "Кувейт",
    "kg": "Кыргызстан",

    "la": "Лаос",
    "lv": "Латвия",
    "lb": "Ливан",
    "ls": "Лесото",
    "lr": "Либерия",
    "ly": "Ливия",
    "li": "Лихтенштейн",
    "lt": "Литва",
    "lu": "Люксембург",

    "mg": "Мадагаскар",
    "mw": "Малави",
    "my": "Малайзия",
    "mv": "Мальдивы",
    "ml": "Мали",
    "mt": "Мальта",
    "mh": "Маршалловы Острова",
    "mr": "Мавритания",
    "mu": "Маврикий",
    "mx": "Мексика",
    "fm": "Микронезия",
    "md": "Молдова",
    "mc": "Монако",
    "mn": "Монголия",
    "me": "Черногория",
    "ma": "Марокко",
    "mz": "Мозамбик",

    "mm": "Мьянма",

    "na": "Намибия",
    "nr": "Науру",
    "np": "Непал",
    "nl": "Нидерланды",
    "nz": "Новая Зеландия",
    "ni": "Никарагуа",
    "ne": "Нигер",
    "ng": "Нигерия",
    "no": "Норвегия",

    "om": "Оман",

    "pk": "Пакистан",
    "pw": "Палау",
    "pa": "Панама",
    "pg": "Папуа — Новая Гвинея",
    "py": "Парагвай",
    "pe": "Перу",
    "ph": "Филиппины",
    "pl": "Польша",
    "pt": "Португалия",

    "qa": "Катар",

    "ro": "Румыния",
    "ru": "Россия",
    "rw": "Руанда",

    "kn": "Сент-Китс и Невис",
    "lc": "Сент-Люсия",
    "vc": "Сент-Винсент и Гренадины",
    "ws": "Самоа",
    "sm": "Сан-Марино",
    "st": "Сан-Томе и Принсипи",
    "sa": "Саудовская Аравия",
    "sn": "Сенегал",
    "rs": "Сербия",
    "sc": "Сейшелы",
    "sl": "Сьерра-Леоне",
    "sg": "Сингапур",
    "sk": "Словакия",
    "si": "Словения",
    "sb": "Соломоновы Острова",
    "so": "Сомали",
    "za": "Южная Африка",
    "ss": "Южный Судан",
    "es": "Испания",
    "lk": "Шри-Ланка",
    "sd": "Судан",
    "sr": "Суринам",
    "se": "Швеция",
    "ch": "Швейцария",
    "sy": "Сирия",

    "tw": "Тайвань",
    "tj": "Таджикистан",
    "tz": "Танзания",
    "th": "Таиланд",
    "tl": "Восточный Тимор",
    "tg": "Того",
    "to": "Тонга",
    "tt": "Тринидад и Тобаго",
    "tn": "Тунис",
    "tr": "Турция",
    "tm": "Туркменистан",
    "tv": "Тувалу",

    "ug": "Уганда",
    "ua": "Украина",
    "ae": "ОАЭ",
    "gb": "Великобритания",
    "us": "США",
    "uy": "Уругвай",
    "uz": "Узбекистан",

    "vu": "Вануату",
    "va": "Ватикан",
    "ve": "Венесуэла",
    "vn": "Вьетнам",

    "ye": "Йемен",

    "zm": "Замбия",
    "zw": "Зимбабве"
}
CONTINENTS = {
    "Европа": [
        "al", "ad", "at", "by", "be", "ba", "bg", "hr", "cy", "cz",
        "dk", "ee", "fi", "fr", "de", "gr", "hu", "is", "ie", "it",
        "lv", "li", "lt", "lu", "mt", "md", "mc", "me", "nl",
        "no", "pl", "pt", "ro", "ru", "sm", "rs", "sk", "si", "es",
        "se", "ch", "ua", "gb", "va"
    ],

    "Азия": [
        "af", "am", "az", "bh", "bd", "bt", "bn", "kh", "cn", "ge",
        "in", "id", "ir", "iq", "il", "jp", "jo", "kz", "kw", "kg",
        "la", "lb", "my", "mv", "mn", "mm", "np", "kp", "kr", "om",
        "pk", "ph", "qa", "sa", "sg", "lk", "sy", "tw", "tj", "th",
        "tl", "tr", "tm", "ae", "uz", "vn", "ye"
    ],

    "Африка": [
        "dz", "ao", "bj", "bw", "bf", "bi", "cv", "cm", "cf", "td",
        "km", "cg", "cd", "dj", "eg", "gq", "er", "sz", "et", "ga",
        "gm", "gh", "gn", "gw", "ke", "ls", "lr", "ly", "mg",
        "mw", "ml", "mr", "mu", "ma", "mz", "na", "ne", "ng", "rw",
        "st", "sn", "sc", "sl", "so", "za", "ss", "sd", "tz", "tg",
        "tn", "ug", "zm", "zw"
    ],

    "САмерика": [
        "ag", "bs", "bb", "bz", "ca", "cr", "cu", "dm", "do", "sv",
        "gd", "gt", "ht", "hn", "jm", "mx", "ni", "pa", "kn", "lc",
        "vc", "tt", "us"
    ],

    "ЮАмерика": [
        "ar", "bo", "br", "cl", "co", "ec", "gy", "py", "pe", "sr",
        "uy", "ve"
    ],

    "Океания": [
        "au", "fj", "ki", "mh", "fm", "nr", "nz", "pw", "pg", "ws",
        "sb", "to", "tv", "vu"
    ]
}


def create_questions(continent=None):
    if continent:
        country_list = {
            iso: countries[iso]
            for iso in CONTINENTS[continent]
        }
    else:
        country_list = countries
    result = random.sample(list(country_list.items()), 4)
    answer = result[0]

    random.shuffle(result)
    return answer, result


def find_iso(iso):
    result = f'w2560/{iso}.png'
    return result
